## Install required package
Install ipython-sql to be able to run sql in Notebook

In [1]:
%load_ext sql

Connection String to your database.

In [2]:
%sql mysql+pymysql://root:1234@localhost/information_schema

In [5]:
%%sql 

select pid, cid, sum(price) from sales.Transcations group by pid, cid with rollup;

 * mysql+pymysql://root:***@localhost/information_schema
10 rows affected.

[(1, 1, Decimal('20.00')),
 (1, 2, Decimal('10.00')),
 (1, 3, Decimal('15.00')),
 (1, None, Decimal('45.00')),
 (2, 1, Decimal('10.00')),
 (2, 2, Decimal('30.00')),
 (2, 3, Decimal('15.00')),
 (2, 4, Decimal('30.00')),
 (2, None, Decimal('85.00')),
 (None, None, Decimal('130.00'))]

In [ ]:
%%sql 

select pid, cid, sum(price) from sales.Transcations group by pid, cid;

In [38]:
%%sql 

select pid, cid, sum(price) from sales.Transcations group by cid, pid with rollup;

 * mysql+pymysql://root:***@localhost/information_schema
   mysql+pymysql://root:***@localhost/movies
12 rows affected.

[(1, 1, Decimal('20.00')),
 (2, 1, Decimal('10.00')),
 (None, 1, Decimal('30.00')),
 (1, 2, Decimal('10.00')),
 (2, 2, Decimal('30.00')),
 (None, 2, Decimal('40.00')),
 (1, 3, Decimal('15.00')),
 (2, 3, Decimal('15.00')),
 (None, 3, Decimal('30.00')),
 (2, 4, Decimal('30.00')),
 (None, 4, Decimal('30.00')),
 (None, None, Decimal('130.00'))]

As Cube is not supported by mysql, we can simulate it as follows:

In [40]:
%%sql 

select pid, cid, sum(price) from sales.Transcations group by cid, pid with rollup
union 
select pid, cid, sum(price) from sales.Transcations group by pid, cid with rollup

 * mysql+pymysql://root:***@localhost/information_schema
   mysql+pymysql://root:***@localhost/movies
14 rows affected.

[(1, 1, Decimal('20.00')),
 (2, 1, Decimal('10.00')),
 (None, 1, Decimal('30.00')),
 (1, 2, Decimal('10.00')),
 (2, 2, Decimal('30.00')),
 (None, 2, Decimal('40.00')),
 (1, 3, Decimal('15.00')),
 (2, 3, Decimal('15.00')),
 (None, 3, Decimal('30.00')),
 (2, 4, Decimal('30.00')),
 (None, 4, Decimal('30.00')),
 (None, None, Decimal('130.00')),
 (1, None, Decimal('45.00')),
 (2, None, Decimal('85.00'))]

Use *Grouping()* --> 1 when grouping level or 0 (if not)

In [6]:
%%sql 

select pid, cid, sum(price), Grouping(pid), Grouping(cid) from sales.Transcations 
group by pid, cid with rollup;

 * mysql+pymysql://root:***@localhost/information_schema
10 rows affected.

[(1, 1, Decimal('20.00'), 0, 0),
 (1, 2, Decimal('10.00'), 0, 0),
 (1, 3, Decimal('15.00'), 0, 0),
 (1, None, Decimal('45.00'), 0, 1),
 (2, 1, Decimal('10.00'), 0, 0),
 (2, 2, Decimal('30.00'), 0, 0),
 (2, 3, Decimal('15.00'), 0, 0),
 (2, 4, Decimal('30.00'), 0, 0),
 (2, None, Decimal('85.00'), 0, 1),
 (None, None, Decimal('130.00'), 1, 1)]